mefe-swakless/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0      (0.01 0 0))
            (0.125  (0.018 0 0))
            (0.25   (0.01 0 0))
            (0.375  (0.002 0 0))
            (0.5    (0.01 0 0))
            (0.625  (0.018 0 0))
            (0.75   (0.01 0 0))
            (0.875  (0.002 0 0))
            (1      (0.01 0 0))
            (1.125  (0.018 0 0))
            (1.25   (0.01 0 0))
            (1.375  (0.002 0 0))
            (1.5    (0.01 0 0))
            (1.625  (0.018 0 0))
            (1.75   (0.01 0 0))
            (1.875  (0.002 0 0))
            (2      (0.01 0 0))
            (2.125  (0.018 0 0))
            (2.25   (0.01 0 0))
            (2.375  (0.002 0 0))
            (2.5    (0.01 0 0))
            (2.625  (0.018 0 0))
            (2.75   (0.01 0 0))
            (2.875  (0.002 0 0))
            (3      (0.01 0 0))
            (3.125  (0.018 0 0))
            (3.25   (0.01 0 0))
            (3.375  (0.002 0 0))
            (3.5    (0.01 0 0))
            (3.625  (0.018 0 0))
            (3.75   (0.01 0 0))
            (3.875  (0.002 0 0))
            (4      (0.01 0 0))
        );
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            noSlip;
    }
}// ************************************************************************* //

