mefe-swakless/0/s
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      s;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0    1)
            (0.15 1)
            (0.151 0)
            (1    0)
        );
    }
    outlet
    {
        type            inletOutlet;
        value           uniform 0;
        inletValue      uniform 0;
    }
    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
