mefe-swakless/system/fvOptions-2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}

scalarSources 
{
    type            scalarCodedSource;
    active          yes;
    name            scalarCoupling;
    selectionMode   all;
    fields          (s crys);
    
    codeAddSup
    #{
        // Parameters
        const scalar kG = 1.2e-4;          // Growth rate constant
        const scalar cSat = 0.08;          // Saturation concentration
        const scalar Crho = 1180;          // Crystal density
        const scalar nucleationThreshold = 0.5;  // High threshold for nucleation
        const scalar inductionTime = 0.2;   // Base induction time
        const label maxNucleationSites = 5; // Maximum number of nucleation sites
        
        // Access fields
        volScalarField& s = const_cast<volScalarField&>(mesh().lookupObject<volScalarField>("s"));
        volScalarField& crys = const_cast<volScalarField&>(mesh().lookupObject<volScalarField>("crys"));
        const scalar currentTime = mesh().time().value();
        const scalar deltaTValue = mesh().time().deltaTValue();
        
        // Create nucleation sites if they don't exist
        static std::vector<label> nucleationCells;
        if (nucleationCells.empty() && currentTime > inductionTime)
        {
            label sitesCreated = 0;
            forAll(s, cellI)
            {
                if (sitesCreated < maxNucleationSites)
                {
                    scalar supersaturation = (s[cellI] - cSat)/cSat;
                    if (supersaturation > nucleationThreshold)
                    {
                        // Random chance to create nucleation site
                        if (scalar(rand())/RAND_MAX > 0.99)
                        {
                            nucleationCells.push_back(cellI);
                            crys[cellI] = 0.1; // Initial seed
                            sitesCreated++;
                        }
                    }
                }
            }
        }
        
        // Growth from nucleation sites
        forAll(s, cellI)
        {
            scalar supersaturation = (s[cellI] - cSat)/cSat;
            if (supersaturation > 0)
            {
                scalar minDist = GREAT;
                
                // Find distance to nearest nucleation site
                for (const label& nucCell : nucleationCells)
                {
                    scalar dist = mag(mesh().C()[cellI] - mesh().C()[nucCell]);
                    minDist = min(minDist, dist);
                }
                
                // Growth rate decreases with distance from nucleation sites
                if (minDist < GREAT)
                {
                    scalar distFactor = exp(-minDist/0.001); // Adjust 0.001 to control growth spread
                    scalar growth = kG * pow(supersaturation, 2) * distFactor * deltaTValue;
                    
                    if (crys[cellI] > 1e-6 || distFactor > 0.1)
                    {
                        crys[cellI] += growth;
                        s[cellI] -= growth * Crho;
                    }
                }
            }
        }
    #};
    
    codeCorrect
    #{
    #};
    
    codeConstrain
    #{
        volScalarField& crys = const_cast<volScalarField&>(mesh().lookupObject<volScalarField>("crys"));
        volScalarField& s = const_cast<volScalarField&>(mesh().lookupObject<volScalarField>("s"));
        
        forAll(crys, cellI)
        {
            crys[cellI] = max(0, min(crys[cellI], 1.0));
            s[cellI] = max(0, s[cellI]);
        }
    #};
}
// ************************************************************************* //
